## Terraform plan (envs/dev)\n\n<details>\n<summary>Plan summary</summary>\n\n<pre>\ncreate:  0\nupdate:  2\ndelete:  0\nreplace: 1\nread:    2\nno_op:   0\n</pre>\n</details>\n\n<details>\n<summary>Full plan</summary>\n\n<pre>
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 &lt;= read (data resources)

Terraform will perform the following actions:

  # module.eks[0].aws_eks_addon.snapshot_controller[0] is tainted, so must be replaced
-/+ resource "aws_eks_addon" "snapshot_controller" {
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      ~ id                          = "goldenpath-dev-eks-31-12-25-04:snapshot-controller" -&gt; (known after apply)
      + modified_at                 = (known after apply)
        tags                        = {
            "BuildId"     = "31-12-25-04"
            "Environment" = "dev"
            "Lifecycle"   = "ephemeral"
            "ManagedBy"   = "terraform"
            "Name"        = "goldenpath-dev-eks-31-12-25-04-snapshot-controller"
            "Owner"       = "platform-team"
            "Project"     = "goldenpath-idp"
        }
        # (6 unchanged attributes hidden)
    }

  # module.iam[0].data.aws_iam_policy_document.cluster_autoscaler_assume[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 &lt;= data "aws_iam_policy_document" "cluster_autoscaler_assume" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = "oidc.eks.eu-west-2.amazonaws.com/id/D7FCED80AB703E858E19C613EF590E1D:aud"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:cluster-autoscaler",
                ]
              + variable = "oidc.eks.eu-west-2.amazonaws.com/id/D7FCED80AB703E858E19C613EF590E1D:sub"
            }

          + principals {
              + identifiers = [
                  + "arn:aws:iam::593517239005:oidc-provider/oidc.eks.eu-west-2.amazonaws.com/id/D7FCED80AB703E858E19C613EF590E1D",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.iam[0].data.aws_iam_policy_document.lb_controller_assume[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 &lt;= data "aws_iam_policy_document" "lb_controller_assume" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = "oidc.eks.eu-west-2.amazonaws.com/id/D7FCED80AB703E858E19C613EF590E1D:aud"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:aws-load-balancer-controller",
                ]
              + variable = "oidc.eks.eu-west-2.amazonaws.com/id/D7FCED80AB703E858E19C613EF590E1D:sub"
            }

          + principals {
              + identifiers = [
                  + "arn:aws:iam::593517239005:oidc-provider/oidc.eks.eu-west-2.amazonaws.com/id/D7FCED80AB703E858E19C613EF590E1D",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.iam[0].aws_iam_role.cluster_autoscaler[0] will be updated in-place
  ~ resource "aws_iam_role" "cluster_autoscaler" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.eu-west-2.amazonaws.com/id/D7FCED80AB703E858E19C613EF590E1D:aud" = "sts.amazonaws.com"
                              - "oidc.eks.eu-west-2.amazonaws.com/id/D7FCED80AB703E858E19C613EF590E1D:sub" = "system:serviceaccount:kube-system:cluster-autoscaler"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::593517239005:oidc-provider/oidc.eks.eu-west-2.amazonaws.com/id/D7FCED80AB703E858E19C613EF590E1D"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -&gt; (known after apply)
        id                    = "goldenpath-idp-cluster-autoscaler-31-12-25-04"
        name                  = "goldenpath-idp-cluster-autoscaler-31-12-25-04"
        tags                  = {
            "BuildId"     = "31-12-25-04"
            "Environment" = "dev"
            "Lifecycle"   = "ephemeral"
            "ManagedBy"   = "terraform"
            "Owner"       = "platform-team"
            "Project"     = "goldenpath-idp"
        }
        # (11 unchanged attributes hidden)
    }

  # module.iam[0].aws_iam_role.lb_controller[0] will be updated in-place
  ~ resource "aws_iam_role" "lb_controller" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.eu-west-2.amazonaws.com/id/D7FCED80AB703E858E19C613EF590E1D:aud" = "sts.amazonaws.com"
                              - "oidc.eks.eu-west-2.amazonaws.com/id/D7FCED80AB703E858E19C613EF590E1D:sub" = "system:serviceaccount:kube-system:aws-load-balancer-controller"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::593517239005:oidc-provider/oidc.eks.eu-west-2.amazonaws.com/id/D7FCED80AB703E858E19C613EF590E1D"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -&gt; (known after apply)
        id                    = "goldenpath-idp-aws-load-balancer-controller-31-12-25-04"
        name                  = "goldenpath-idp-aws-load-balancer-controller-31-12-25-04"
        tags                  = {
            "BuildId"     = "31-12-25-04"
            "Environment" = "dev"
            "Lifecycle"   = "ephemeral"
            "ManagedBy"   = "terraform"
            "Owner"       = "platform-team"
            "Project"     = "goldenpath-idp"
        }
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
</pre>\n</details>\n\n